In [1]:
import pandas as p

In [2]:
cab_data = p.read_csv('C:\\Users\\cemre\\Documents\\repos\\G2M_Insight_for_Cab_Investment_Firm_Project\\Datasets\\Cab_Data.csv')
city_data = p.read_csv('C:\\Users\\cemre\\Documents\\repos\\G2M_Insight_for_Cab_Investment_Firm_Project\\Datasets\\City.csv')
customer_data = p.read_csv('C:\\Users\\cemre\\Documents\\repos\\G2M_Insight_for_Cab_Investment_Firm_Project\\Datasets\\Customer_ID.csv')
transaction_data = p.read_csv('C:\\Users\\cemre\\Documents\\repos\\G2M_Insight_for_Cab_Investment_Firm_Project\\Datasets\\Transaction_ID.csv')

In [3]:
cab_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  359392 non-null  int64
 1   Date of Travel  359392 non-null  object
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM Travelled    359392 non-null  float64
 5   Price Charged   359392 non-null  float64
 6   Cost of Trip    359392 non-null  float64
dtypes: float64(3), int64(1), object(3)
memory usage: 19.2+ MB

In [4]:
cab_data.head()

,Transaction ID,Date of Travel,Company,City,KM Travelled,Price Charged,Cost of Trip
0,10000011,1/8/2016,Pink Cab,ATLANTA GA,30.45,370.95,313.635
1,10000012,1/6/2016,Pink Cab,ATLANTA GA,28.62,358.52,334.854
2,10000013,1/2/2016,Pink Cab,ATLANTA GA,9.04,125.20,97.632
3,10000014,1/7/2016,Pink Cab,ATLANTA GA,33.17,377.40,351.602
4,10000015,1/3/2016,Pink Cab,ATLANTA GA,8.73,114.62,97.776

In [5]:
city_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes

In [6]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [7]:
transaction_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction ID  440098 non-null  int64
 1   Customer ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
dtypes: int64(2), object(1)
memory usage: 10.1+ MB

In [8]:
cab_data.isna().sum()

Transaction ID    0
Date of Travel    0
Company           0
City              0
KM Travelled      0
Price Charged     0
Cost of Trip      0
dtype: int64

In [9]:
city_data.isna().sum()

City          0
Population    0
Users         0
dtype: int64

In [10]:
customer_data.isna().sum()

Customer ID           0
Gender                0
Age                   0
Income (USD/Month)    0
dtype: int64

In [11]:
transaction_data.isna().sum()

Transaction ID    0
Customer ID       0
Payment_Mode      0
dtype: int64

In [12]:
cab_data[cab_data.duplicated()]

Empty DataFrame
Columns: [Transaction ID, Date of Travel, Company, City, KM Travelled, Price Charged, Cost of Trip]
Index: []

In [13]:
customer_data[customer_data.duplicated()]

Empty DataFrame
Columns: [Customer ID, Gender, Age, Income (USD/Month)]
Index: []

In [14]:
city_data[city_data.duplicated()]

Empty DataFrame
Columns: [City, Population, Users]
Index: []

In [15]:
transaction_data[transaction_data.duplicated()]

Empty DataFrame
Columns: [Transaction ID, Customer ID, Payment_Mode]
Index: []

In [16]:
cab_data_numeric = cab_data.select_dtypes(include = 'number')
cab_data_non_numeric = cab_data.select_dtypes(exclude = 'number')
cab_data_numeric.describe().T

,count,mean,std,min,25%,50%,75%,max
Transaction ID,359392.0,1.022076e+07,126805.803715,10000011.0,1.011081e+07,10221035.50,1.033094e+07,10440107.00
KM Travelled,359392.0,2.256725e+01,12.233526,1.9,1.200000e+01,22.44,3.296000e+01,48.00
Price Charged,359392.0,4.234433e+02,274.378911,15.6,2.064375e+02,386.36,5.836600e+02,2048.03
Cost of Trip,359392.0,2.861901e+02,157.993661,19.0,1.512000e+02,282.48,4.136832e+02,691.20

In [17]:
customer_data_numeric = customer_data.select_dtypes(include = 'number')
customer_data_non_numeric = customer_data.select_dtypes(exclude = 'number')
customer_data_numeric.describe().T

,count,mean,std,min,25%,50%,75%,max
Customer ID,49171.0,28398.252283,17714.137333,1.0,12654.5,27631.0,43284.5,60000.0
Age,49171.0,35.363121,12.599066,18.0,25.0,33.0,42.0,65.0
Income (USD/Month),49171.0,15015.631856,8002.208253,2000.0,8289.5,14656.0,21035.0,35000.0

In [18]:
transaction_data_numeric = transaction_data.select_dtypes(include = 'number')
transaction_data_non_numeric = transaction_data.select_dtypes(exclude = 'number')
transaction_data_numeric.describe().T

,count,mean,std,min,25%,50%,75%,max
Transaction ID,440098.0,1.022006e+07,127045.493722,10000011.0,10110035.25,10220059.5,10330083.75,10440108.0
Customer ID,440098.0,2.361951e+04,21195.549816,1.0,3530.00,15168.0,43884.00,60000.0

In [19]:
city_data_numeric = city_data.select_dtypes(include = 'number')
city_data_non_numeric = city_data.select_dtypes(exclude = 'number')
#no numeric values

In [20]:
#changing attribute names (Cab_Data.csv)
cab_data = cab_data.rename(columns={'Transaction ID':'Transaction_ID'})
cab_data = cab_data.rename(columns={'Date of Travel':'Date_of_Travel'})
cab_data = cab_data.rename(columns={'KM Travelled':'KM_Travelled'})
cab_data = cab_data.rename(columns={'Price Charged':'Price_Charged'})
cab_data = cab_data.rename(columns={'Cost of Trip':'Cost_of_Trip'})

In [21]:
#changing attribute names (Customer_ID_csv)
customer_data = customer_data.rename(columns={'Customer ID':'Customer_ID'})

In [22]:
#changing attribute names (Transaction_ID.csv)
transaction_data = transaction_data.rename(columns={'Customer ID':'Customer_ID'})
transaction_data = transaction_data.rename(columns={'Transaction ID':'Transaction_ID'})

In [23]:
city_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   City        20 non-null     object
 1   Population  20 non-null     object
 2   Users       20 non-null     object
dtypes: object(3)
memory usage: 608.0+ bytes

In [24]:
customer_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 49171 entries, 0 to 49170
Data columns (total 4 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Customer_ID         49171 non-null  int64
 1   Gender              49171 non-null  object
 2   Age                 49171 non-null  int64
 3   Income (USD/Month)  49171 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.5+ MB

In [25]:
transaction_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 440098 entries, 0 to 440097
Data columns (total 3 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction_ID  440098 non-null  int64
 1   Customer_ID     440098 non-null  int64
 2   Payment_Mode    440098 non-null  object
dtypes: int64(2), object(1)
memory usage: 10.1+ MB

In [26]:
cab_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 359392 entries, 0 to 359391
Data columns (total 7 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Transaction_ID  359392 non-null  int64
 1   Date_of_Travel  359392 non-null  object
 2   Company         359392 non-null  object
 3   City            359392 non-null  object
 4   KM_Travelled    359392 non-null  float64
 5   Price_Charged   359392 non-null  float64
 6   Cost_of_Trip    359392 non-null  float64
dtypes: float64(3), int64(1), object(3)
memory usage: 19.2+ MB

In [27]:
#adding new datasets which contain changed value names
transaction_data.to_pickle('C:\\Users\\cemre\\Documents\\repos\\G2M_Insight_for_Cab_Investment_Firm_Project\\Datasets\\Transaction_ID.pkl')
city_data.to_pickle('C:\\Users\\cemre\\Documents\\repos\\G2M_Insight_for_Cab_Investment_Firm_Project\\Datasets\\City.pkl')
cab_data.to_pickle('C:\\Users\\cemre\\Documents\\repos\\G2M_Insight_for_Cab_Investment_Firm_Project\\Datasets\\Cab_Data.pkl')
customer_data.to_pickle('C:\\Users\\cemre\\Documents\\repos\\G2M_Insight_for_Cab_Investment_Firm_Project\\Datasets\\Customer_ID.pkl')